/*
===========================================================================
ARX FATALIS GPL Source Code
Copyright (C) 1999-2010 Arkane Studios SA, a ZeniMax Media company.

This file is part of the Arx Fatalis GPL Source Code ('Arx Fatalis Source Code'). 

Arx Fatalis Source Code is free software: you can redistribute it and/or modify it under the terms of the GNU General Public 
License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.

Arx Fatalis Source Code is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied 
warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with Arx Fatalis Source Code.  If not, see 
<http://www.gnu.org/licenses/>.

In addition, the Arx Fatalis Source Code is also subject to certain additional terms. You should have received a copy of these 
additional terms immediately following the terms and conditions of the GNU General Public License which accompanied the Arx 
Fatalis Source Code. If not, please request a copy in writing from Arkane Studios at the address below.

If you have questions concerning this license or the applicable additional terms, you may contact in writing Arkane Studios, c/o 
ZeniMax Media Inc., Suite 120, Rockville, Maryland 20850 USA.
===========================================================================
*/
//////////////////////////////////////////////////////////////////////////////////////
//   @@        @@@        @@@                @@                           @@@@@     //
//   @@@       @@@@@@     @@@     @@        @@@@                         @@@  @@@   //
//   @@@       @@@@@@@    @@@    @@@@       @@@@      @@                @@@@        //
//   @@@       @@  @@@@   @@@  @@@@@       @@@@@@     @@@               @@@         //
//  @@@@@      @@  @@@@   @@@ @@@@@        @@@@@@@    @@@            @  @@@         //
//  @@@@@      @@  @@@@  @@@@@@@@         @@@@ @@@    @@@@@         @@ @@@@@@@      //
//  @@ @@@     @@  @@@@  @@@@@@@          @@@  @@@    @@@@@@        @@ @@@@         //
// @@@ @@@    @@@ @@@@   @@@@@            @@@@@@@@@   @@@@@@@      @@@ @@@@         //
// @@@ @@@@   @@@@@@@    @@@@@@           @@@  @@@@   @@@ @@@      @@@ @@@@         //
// @@@@@@@@   @@@@@      @@@@@@@@@@      @@@    @@@   @@@  @@@    @@@  @@@@@        //
// @@@  @@@@  @@@@       @@@  @@@@@@@    @@@    @@@   @@@@  @@@  @@@@  @@@@@        //
//@@@   @@@@  @@@@@      @@@      @@@@@@ @@     @@@   @@@@   @@@@@@@    @@@@@ @@@@@ //
//@@@   @@@@@ @@@@@     @@@@        @@@  @@      @@   @@@@   @@@@@@@    @@@@@@@@@   //
//@@@    @@@@ @@@@@@@   @@@@             @@      @@   @@@@    @@@@@      @@@@@      //
//@@@    @@@@ @@@@@@@   @@@@             @@      @@   @@@@    @@@@@       @@        //
//@@@    @@@  @@@ @@@@@                          @@            @@@                  //
//            @@@ @@@                           @@             @@        STUDIOS    //
//////////////////////////////////////////////////////////////////////////////////////                                                                                     
///////////////////////////////////////////////////////////////////////////////
// EERIEPoly
///////////////////////////////////////////////////////////////////////////////
//
// Description:
//	Hum...hum
//
// Updates: (date) (person) (update)
//
// Code: Cyril Meynier
//
// Copyright (c) 1999 ARKANE Studios SA. All rights reserved
///////////////////////////////////////////////////////////////////////////////
#ifndef EERIEPOLY_H
#define EERIEPOLY_H


#include "EERIETypes.h"

void specialEE_RTP(D3DTLVERTEX*,D3DTLVERTEX*);
void EERIE_CreateMatriceProj(float _fWidth,float _fHeight,float _fFOV,float _fZNear,float _fZFar);

//-----------------------------------------------------------------------------
typedef struct
{
	char			path[256]; // path[0]==0 means an unallocated slot
	EERIE_ANIM **	anims;
	long *			sizes;
	short			alt_nb;
	long			locks;
} ANIM_HANDLE;

//minimap special infos
typedef struct
{
	short x;
	short y;
} EERIE_S2D;

typedef struct
{
	float posx;
	float posy;
	float posz;
	float ycos;
	float ysin;
	float xsin;
	float xcos;
	float use_focal;
	float xmod;
	float ymod;
	float zmod;
} EERIE_TRANSFORM;

typedef struct
{
	EERIE_TRANSFORM transform;
	EERIE_3D pos; // 0 4 8
	float	Ycos; // 12
	float	Ysin; // 16
	float	Xcos; // 20
	float	Xsin; // 24
	float	Zcos; // 28
	float	Zsin; // 32	
	float	focal;// 36
	float	use_focal;
	float	Zmul; // 40
	float posleft;// 44
	float postop; // 48 do not move/insert before this point !!!
	
	float	xmod;
	float	ymod;
	EERIEMATRIX matrix;
	EERIE_3D angle;

	EERIE_3D d_pos;
	EERIE_3D d_angle;
	EERIE_3D lasttarget;
	EERIE_3D lastpos;
	EERIE_3D translatetarget;
	BOOL	lastinfovalid;
	EERIE_3D norm;
	EERIE_RGB	fadecolor;
	RECT	clip;
	float	clipz0;
	float	clipz1;
	long	centerx;
	long	centery;
	
	float	smoothing;
	float	AddX;
	float	AddY;
	long	Xsnap;
	long	Zsnap;
	float	Zdiv;
	
	long	clip3D;
	long	type;
	long	bkgcolor;
	long	nbdrawn;
	float	cdepth;

	EERIE_3D	size;
} EERIE_CAMERA;

#define ANCHOR_FLAG_GREEN_DRAW	1
#define ANCHOR_FLAG_BLOCKED		8

typedef struct _ANCHOR_DATA
{
	EERIE_3D	pos;
	short		nblinked;
	short		flags;
	long	*	linked;
	float		radius;
	float		height;
} _ANCHOR_DATA;

typedef struct
{
	char				treat;
	char				nothing;
	short				nbpoly;
	short				nbianchors;
	short				nbpolyin;
	float				frustrum_miny;
